import React from 'react';

const cardsArray = {
  hearts: ['🂠', '🂱', '🂲', '🂳', '🂴', '🂵', '🂶', '🂷', '🂸', '🂹', '🂺', '🂻', '🂽', '🂾'],
  diamonds: ['🂠', '🃁', '🃂', '🃃', '🃄', '🃅', '🃆', '🃇', '🃈', '🃉', '🃊', '🃋', '🃍', '🃎'],
  clubs: ['🂠', '🃑', '🃒', '🃓', '🃔', '🃕', '🃖', '🃗', '🃘', '🃙', '🃚', '🃛', '🃝', '	🃞'],
  spades: ['🂠', '🂡', '🂢', '🂣', '🂤', '🂥', '🂦', '🂧', '🂨', '🂩', '🂪', '🂫', '🂭', '🂮']
};

export default function Card({ number, type }) {
  return (
    <span className='card' style={{ fontSize: '1000%' }}>
      {cardsArray[type][number]}
    </span>
  );
}
